CREATE VIEW Отчет AS
SELECT 
    Клиенты.Фамилия,
    Клиенты.Имя,
    Заказы.ID_заказа,
    Заказы.Дата,
    Товары.Название AS Товар,
    [Состав заказа].Количество,
    CAST(LEFT(Товары.Цена, CHARINDEX(' ', Товары.Цена) - 1) AS DECIMAL(10,2)) AS Цена,
    CAST(LEFT(Товары.Цена, CHARINDEX(' ', Товары.Цена) - 1) AS DECIMAL(10,2)) * [Состав заказа].Количество AS Сумма
FROM 
    Клиенты
    INNER JOIN Заказы ON Клиенты.ID_клиента = Заказы.[Код клиента]
    INNER JOIN [Состав заказа] ON Заказы.ID_заказа = [Состав заказа].[Код заказа]
    INNER JOIN Товары ON [Состав заказа].[Код товара] = Товары.ID_товара;