SELECT 
    Клиенты.Фамилия,
    Клиенты.Имя,
    COUNT(DISTINCT Заказы.ID_заказа) AS КоличествоЗаказов,
    SUM(CAST(LEFT(Товары.Цена, CHARINDEX(' ', Товары.Цена) - 1)AS DECIMAL(10,1)) * "Состав заказа".Количество) AS "Общая стоимость"
FROM 
    Клиенты
    INNER JOIN Заказы ON Клиенты.ID_клиента = Заказы."Код клиента"
    INNER JOIN "Состав заказа" ON Заказы.ID_заказа = "Состав заказа"."Код заказа"
    INNER JOIN Товары ON "Состав заказа"."Код товара" = Товары.ID_товара
GROUP BY 
    Клиенты.Фамилия, Клиенты.Имя
HAVING 
    SUM(CAST(LEFT(Товары.Цена, CHARINDEX(' ', Товары.Цена) - 1)AS DECIMAL(10,1)) * "Состав заказа".Количество) > 150;